In [1]:
import psycopg2
import sqlite3
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')
df['Name'] = df['Name'].str.replace("'", "", regex=True)
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [3]:
df.iloc[28]

Survived                                    1
Pclass                                      3
Name                       Miss. Ellen ODwyer
Sex                                    female
Age                                        24
Siblings/Spouses Aboard                     0
Parents/Children Aboard                     0
Fare                                   7.8792
Name: 28, dtype: object

In [4]:
dbname = 'oeoiketr'
user = 'oeoiketr'
password = 'br_jAI5i6XM0D6roMuvNKUY99OWZ_X0D'
host = 'salt.db.elephantsql.com'

In [5]:
conn = psycopg2.connect(dbname=dbname, user=user, password=password, host=host)
conn

In [6]:
curs = conn.cursor()
curs

In [6]:
curs.execute('DROP TABLE titanic_table')
conn.commit()

In [7]:
curs.execute('''CREATE TABLE titanic_table (
                   id SERIAL PRIMARY KEY,
                   survived INT,
                   pclass INT,
                   name VARCHAR(100),
                   sex VARCHAR(10),
                   age FLOAT,
                   sibs_spouse INT,
                   par_child INT,
                   fare FLOAT);
                ''')
conn.commit()

In [7]:
sl_conn = sqlite3.connect('titantic_temp.sqlite3')

In [8]:
df.to_sql('titanic_temp', sl_conn)

C:\Users\charl\Anaconda3\lib\site-packages\pandas\core\generic.py:2531: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  dtype=dtype, method=method)

In [9]:
sl_curs = sl_conn.cursor()

In [11]:
passengers = sl_curs.execute('SELECT * FROM titanic_temp;').fetchall()
str(passengers[46])

"(46, 1, 3, 'Miss. Bridget ODriscoll', 'female', 27.0, 0, 0, 7.75)"

In [12]:
for passenger in passengers:
    curs.execute("INSERT INTO titanic_table VALUES" + str(passenger) + ";")